app/controllers/user_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES('Lucas', '2010-03-26 19:02:20', '2010-03-26 19:02:20')
---
  def create
    @user = User.new(params[:user])
    if (@user.save)

SELECT * FROM "users" WHERE ("users"."name" = 'Lucas') LIMIT 1
DELETE FROM "users" WHERE ("id" IN (1))
---
  def remove
    if cookies[:user]
      @user = User.find(:first, :conditions => {:name => cookies[:user]})
      @user.delete